/* automatically generated by rust-bindgen 0.57.0 */

pub const TJ_NUMINIT: u32 = 3;
pub const TJ_NUMSAMP: u32 = 7;
pub const TJ_NUMPF: u32 = 12;
pub const TJ_NUMCS: u32 = 5;
pub const TJ_NUMERR: u32 = 2;
pub const TJ_NUMXOP: u32 = 8;
pub const TJXOPT_PERFECT: u32 = 1;
pub const TJXOPT_TRIM: u32 = 2;
pub const TJXOPT_CROP: u32 = 4;
pub const TJXOPT_GRAY: u32 = 8;
pub const TJXOPT_NOOUTPUT: u32 = 16;
pub const TJXOPT_PROGRESSIVE: u32 = 32;
pub const TJXOPT_COPYNONE: u32 = 64;
pub const TJXOPT_ARITHMETIC: u32 = 128;
pub const TJXOPT_OPTIMIZE: u32 = 256;
pub const NUMSUBOPT: u32 = 7;
pub const TJ_BGR: u32 = 1;
pub const TJ_ALPHAFIRST: u32 = 64;
pub const TJ_YUV: u32 = 512;
pub const TJFLAG_BOTTOMUP: u32 = 2;
pub const TJFLAG_FORCEMMX: u32 = 8;
pub const TJFLAG_FORCESSE: u32 = 16;
pub const TJFLAG_FORCESSE2: u32 = 32;
pub const TJFLAG_FORCESSE3: u32 = 128;
pub const TJFLAG_FASTUPSAMPLE: u32 = 256;
pub const TJFLAG_NOREALLOC: u32 = 1024;
pub const TJFLAG_FASTDCT: u32 = 2048;
pub const TJFLAG_ACCURATEDCT: u32 = 4096;
pub const TJFLAG_STOPONWARNING: u32 = 8192;
pub const TJFLAG_PROGRESSIVE: u32 = 16384;
pub const TJFLAG_LIMITSCANS: u32 = 32768;
pub type size_t = libc::c_ulong;
pub type wchar_t = libc::c_int;
#[repr(C)]
#[repr(align(16))]
#[derive(Debug, Copy, Clone)]
pub struct max_align_t {
    pub __clang_max_align_nonce1: libc::c_longlong,
    pub __bindgen_padding_0: u64,
    pub __clang_max_align_nonce2: u128,
}
#[test]
fn bindgen_test_layout_max_align_t() {
    assert_eq!(
        ::core::mem::size_of::<max_align_t>(),
        32usize,
        concat!("Size of: ", stringify!(max_align_t))
    );
    assert_eq!(
        ::core::mem::align_of::<max_align_t>(),
        16usize,
        concat!("Alignment of ", stringify!(max_align_t))
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<max_align_t>())).__clang_max_align_nonce1 as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(max_align_t),
            "::",
            stringify!(__clang_max_align_nonce1)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<max_align_t>())).__clang_max_align_nonce2 as *const _ as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(max_align_t),
            "::",
            stringify!(__clang_max_align_nonce2)
        )
    );
}
#[doc = " Initialize the TurboJPEG instance for compression."]
pub const TJINIT_TJINIT_COMPRESS: TJINIT = 0;
#[doc = " Initialize the TurboJPEG instance for decompression."]
pub const TJINIT_TJINIT_DECOMPRESS: TJINIT = 1;
#[doc = " Initialize the TurboJPEG instance for lossless transformation (both"]
#[doc = " compression and decompression.)"]
pub const TJINIT_TJINIT_TRANSFORM: TJINIT = 2;
#[doc = " Initialization options"]
pub type TJINIT = libc::c_uint;
#[doc = " 4:4:4 chrominance subsampling (no chrominance subsampling)"]
#[doc = ""]
#[doc = " The JPEG or YUV image will contain one chrominance component for every"]
#[doc = " pixel in the source image."]
pub const TJSAMP_TJSAMP_444: TJSAMP = 0;
#[doc = " 4:2:2 chrominance subsampling"]
#[doc = ""]
#[doc = " The JPEG or YUV image will contain one chrominance component for every 2x1"]
#[doc = " block of pixels in the source image."]
pub const TJSAMP_TJSAMP_422: TJSAMP = 1;
#[doc = " 4:2:0 chrominance subsampling"]
#[doc = ""]
#[doc = " The JPEG or YUV image will contain one chrominance component for every 2x2"]
#[doc = " block of pixels in the source image."]
pub const TJSAMP_TJSAMP_420: TJSAMP = 2;
#[doc = " Grayscale"]
#[doc = ""]
#[doc = " The JPEG or YUV image will contain no chrominance components."]
pub const TJSAMP_TJSAMP_GRAY: TJSAMP = 3;
#[doc = " 4:4:0 chrominance subsampling"]
#[doc = ""]
#[doc = " The JPEG or YUV image will contain one chrominance component for every 1x2"]
#[doc = " block of pixels in the source image."]
#[doc = ""]
#[doc = " @note 4:4:0 subsampling is not fully accelerated in libjpeg-turbo."]
pub const TJSAMP_TJSAMP_440: TJSAMP = 4;
#[doc = " 4:1:1 chrominance subsampling"]
#[doc = ""]
#[doc = " The JPEG or YUV image will contain one chrominance component for every 4x1"]
#[doc = " block of pixels in the source image.  All else being equal, a JPEG image"]
#[doc = " with 4:1:1 subsampling is almost exactly the same size as a JPEG image"]
#[doc = " with 4:2:0 subsampling, and in the aggregate, both subsampling methods"]
#[doc = " produce approximately the same perceptual quality.  However, 4:1:1 is"]
#[doc = " better able to reproduce sharp horizontal features."]
#[doc = ""]
#[doc = " @note 4:1:1 subsampling is not fully accelerated in libjpeg-turbo."]
pub const TJSAMP_TJSAMP_411: TJSAMP = 5;
#[doc = " 4:4:1 chrominance subsampling"]
#[doc = ""]
#[doc = " The JPEG or YUV image will contain one chrominance component for every 1x4"]
#[doc = " block of pixels in the source image.  All else being equal, a JPEG image"]
#[doc = " with 4:4:1 subsampling is almost exactly the same size as a JPEG image"]
#[doc = " with 4:2:0 subsampling, and in the aggregate, both subsampling methods"]
#[doc = " produce approximately the same perceptual quality.  However, 4:4:1 is"]
#[doc = " better able to reproduce sharp vertical features."]
#[doc = ""]
#[doc = " @note 4:4:1 subsampling is not fully accelerated in libjpeg-turbo."]
pub const TJSAMP_TJSAMP_441: TJSAMP = 6;
#[doc = " Unknown subsampling"]
#[doc = ""]
#[doc = " The JPEG image uses an unusual type of chrominance subsampling.  Such"]
#[doc = " images can be decompressed into packed-pixel images, but they cannot be"]
#[doc = " - decompressed into planar YUV images,"]
#[doc = " - losslessly transformed if #TJXOPT_CROP is specified and #TJXOPT_GRAY is"]
#[doc = " not specified, or"]
#[doc = " - partially decompressed using a cropping region."]
pub const TJSAMP_TJSAMP_UNKNOWN: TJSAMP = -1;
#[doc = " Chrominance subsampling options"]
#[doc = ""]
#[doc = " When pixels are converted from RGB to YCbCr (see #TJCS_YCbCr) or from CMYK"]
#[doc = " to YCCK (see #TJCS_YCCK) as part of the JPEG compression process, some of"]
#[doc = " the Cb and Cr (chrominance) components can be discarded or averaged together"]
#[doc = " to produce a smaller image with little perceptible loss of image quality."]
#[doc = " (The human eye is more sensitive to small changes in brightness than to"]
#[doc = " small changes in color.)  This is called \"chrominance subsampling\"."]
pub type TJSAMP = libc::c_int;
extern "C" {
    pub static tjMCUWidth: [libc::c_int; 7usize];
}
extern "C" {
    pub static tjMCUHeight: [libc::c_int; 7usize];
}
#[doc = " RGB pixel format"]
#[doc = ""]
#[doc = " The red, green, and blue components in the image are stored in 3-sample"]
#[doc = " pixels in the order R, G, B from lowest to highest memory address within"]
#[doc = " each pixel."]
pub const TJPF_TJPF_RGB: TJPF = 0;
#[doc = " BGR pixel format"]
#[doc = ""]
#[doc = " The red, green, and blue components in the image are stored in 3-sample"]
#[doc = " pixels in the order B, G, R from lowest to highest memory address within"]
#[doc = " each pixel."]
pub const TJPF_TJPF_BGR: TJPF = 1;
#[doc = " RGBX pixel format"]
#[doc = ""]
#[doc = " The red, green, and blue components in the image are stored in 4-sample"]
#[doc = " pixels in the order R, G, B from lowest to highest memory address within"]
#[doc = " each pixel.  The X component is ignored when compressing/encoding and"]
#[doc = " undefined when decompressing/decoding."]
pub const TJPF_TJPF_RGBX: TJPF = 2;
#[doc = " BGRX pixel format"]
#[doc = ""]
#[doc = " The red, green, and blue components in the image are stored in 4-sample"]
#[doc = " pixels in the order B, G, R from lowest to highest memory address within"]
#[doc = " each pixel.  The X component is ignored when compressing/encoding and"]
#[doc = " undefined when decompressing/decoding."]
pub const TJPF_TJPF_BGRX: TJPF = 3;
#[doc = " XBGR pixel format"]
#[doc = ""]
#[doc = " The red, green, and blue components in the image are stored in 4-sample"]
#[doc = " pixels in the order R, G, B from highest to lowest memory address within"]
#[doc = " each pixel.  The X component is ignored when compressing/encoding and"]
#[doc = " undefined when decompressing/decoding."]
pub const TJPF_TJPF_XBGR: TJPF = 4;
#[doc = " XRGB pixel format"]
#[doc = ""]
#[doc = " The red, green, and blue components in the image are stored in 4-sample"]
#[doc = " pixels in the order B, G, R from highest to lowest memory address within"]
#[doc = " each pixel.  The X component is ignored when compressing/encoding and"]
#[doc = " undefined when decompressing/decoding."]
pub const TJPF_TJPF_XRGB: TJPF = 5;
#[doc = " Grayscale pixel format"]
#[doc = ""]
#[doc = " Each 1-sample pixel represents a luminance (brightness) level from 0 to"]
#[doc = " the maximum sample value (which is, for instance, 255 for 8-bit samples or"]
#[doc = " 4095 for 12-bit samples or 65535 for 16-bit samples.)"]
pub const TJPF_TJPF_GRAY: TJPF = 6;
#[doc = " RGBA pixel format"]
#[doc = ""]
#[doc = " This is the same as @ref TJPF_RGBX, except that when"]
#[doc = " decompressing/decoding, the X component is guaranteed to be equal to the"]
#[doc = " maximum sample value, which can be interpreted as an opaque alpha channel."]
pub const TJPF_TJPF_RGBA: TJPF = 7;
#[doc = " BGRA pixel format"]
#[doc = ""]
#[doc = " This is the same as @ref TJPF_BGRX, except that when"]
#[doc = " decompressing/decoding, the X component is guaranteed to be equal to the"]
#[doc = " maximum sample value, which can be interpreted as an opaque alpha channel."]
pub const TJPF_TJPF_BGRA: TJPF = 8;
#[doc = " ABGR pixel format"]
#[doc = ""]
#[doc = " This is the same as @ref TJPF_XBGR, except that when"]
#[doc = " decompressing/decoding, the X component is guaranteed to be equal to the"]
#[doc = " maximum sample value, which can be interpreted as an opaque alpha channel."]
pub const TJPF_TJPF_ABGR: TJPF = 9;
#[doc = " ARGB pixel format"]
#[doc = ""]
#[doc = " This is the same as @ref TJPF_XRGB, except that when"]
#[doc = " decompressing/decoding, the X component is guaranteed to be equal to the"]
#[doc = " maximum sample value, which can be interpreted as an opaque alpha channel."]
pub const TJPF_TJPF_ARGB: TJPF = 10;
#[doc = " CMYK pixel format"]
#[doc = ""]
#[doc = " Unlike RGB, which is an additive color model used primarily for display,"]
#[doc = " CMYK (Cyan/Magenta/Yellow/Key) is a subtractive color model used primarily"]
#[doc = " for printing.  In the CMYK color model, the value of each color component"]
#[doc = " typically corresponds to an amount of cyan, magenta, yellow, or black ink"]
#[doc = " that is applied to a white background.  In order to convert between CMYK"]
#[doc = " and RGB, it is necessary to use a color management system (CMS.)  A CMS"]
#[doc = " will attempt to map colors within the printer's gamut to perceptually"]
#[doc = " similar colors in the display's gamut and vice versa, but the mapping is"]
#[doc = " typically not 1:1 or reversible, nor can it be defined with a simple"]
#[doc = " formula.  Thus, such a conversion is out of scope for a codec library."]
#[doc = " However, the TurboJPEG API allows for compressing packed-pixel CMYK images"]
#[doc = " into YCCK JPEG images (see #TJCS_YCCK) and decompressing YCCK JPEG images"]
#[doc = " into packed-pixel CMYK images."]
pub const TJPF_TJPF_CMYK: TJPF = 11;
#[doc = " Unknown pixel format"]
#[doc = ""]
#[doc = " Currently this is only used by #tj3LoadImage8(), #tj3LoadImage12(), and"]
#[doc = " #tj3LoadImage16()."]
pub const TJPF_TJPF_UNKNOWN: TJPF = -1;
#[doc = " Pixel formats"]
pub type TJPF = libc::c_int;
extern "C" {
    pub static tjRedOffset: [libc::c_int; 12usize];
}
extern "C" {
    pub static tjGreenOffset: [libc::c_int; 12usize];
}
extern "C" {
    pub static tjBlueOffset: [libc::c_int; 12usize];
}
extern "C" {
    pub static tjAlphaOffset: [libc::c_int; 12usize];
}
extern "C" {
    pub static tjPixelSize: [libc::c_int; 12usize];
}
#[doc = " RGB colorspace"]
#[doc = ""]
#[doc = " When generating the JPEG image, the R, G, and B components in the source"]
#[doc = " image are reordered into image planes, but no colorspace conversion or"]
#[doc = " subsampling is performed.  RGB JPEG images can be generated from and"]
#[doc = " decompressed to packed-pixel images with any of the extended RGB or"]
#[doc = " grayscale pixel formats, but they cannot be generated from or"]
#[doc = " decompressed to planar YUV images."]
pub const TJCS_TJCS_RGB: TJCS = 0;
#[doc = " YCbCr colorspace"]
#[doc = ""]
#[doc = " YCbCr is not an absolute colorspace but rather a mathematical"]
#[doc = " transformation of RGB designed solely for storage and transmission.  YCbCr"]
#[doc = " images must be converted to RGB before they can be displayed.  In the"]
#[doc = " YCbCr colorspace, the Y (luminance) component represents the black & white"]
#[doc = " portion of the original image, and the Cb and Cr (chrominance) components"]
#[doc = " represent the color portion of the original image.  Historically, the"]
#[doc = " analog equivalent of this transformation allowed the same signal to be"]
#[doc = " displayed to both black & white and color televisions, but JPEG images use"]
#[doc = " YCbCr primarily because it allows the color data to be optionally"]
#[doc = " subsampled in order to reduce network and disk usage.  YCbCr is the most"]
#[doc = " common JPEG colorspace, and YCbCr JPEG images can be generated from and"]
#[doc = " decompressed to packed-pixel images with any of the extended RGB or"]
#[doc = " grayscale pixel formats.  YCbCr JPEG images can also be generated from"]
#[doc = " and decompressed to planar YUV images."]
pub const TJCS_TJCS_YCbCr: TJCS = 1;
#[doc = " Grayscale colorspace"]
#[doc = ""]
#[doc = " The JPEG image retains only the luminance data (Y component), and any"]
#[doc = " color data from the source image is discarded.  Grayscale JPEG images can"]
#[doc = " be generated from and decompressed to packed-pixel images with any of the"]
#[doc = " extended RGB or grayscale pixel formats, or they can be generated from"]
#[doc = " and decompressed to planar YUV images."]
pub const TJCS_TJCS_GRAY: TJCS = 2;
#[doc = " CMYK colorspace"]
#[doc = ""]
#[doc = " When generating the JPEG image, the C, M, Y, and K components in the"]
#[doc = " source image are reordered into image planes, but no colorspace conversion"]
#[doc = " or subsampling is performed.  CMYK JPEG images can only be generated from"]
#[doc = " and decompressed to packed-pixel images with the CMYK pixel format."]
pub const TJCS_TJCS_CMYK: TJCS = 3;
#[doc = " YCCK colorspace"]
#[doc = ""]
#[doc = " YCCK (AKA \"YCbCrK\") is not an absolute colorspace but rather a"]
#[doc = " mathematical transformation of CMYK designed solely for storage and"]
#[doc = " transmission.  It is to CMYK as YCbCr is to RGB.  CMYK pixels can be"]
#[doc = " reversibly transformed into YCCK, and as with YCbCr, the chrominance"]
#[doc = " components in the YCCK pixels can be subsampled without incurring major"]
#[doc = " perceptual loss.  YCCK JPEG images can only be generated from and"]
#[doc = " decompressed to packed-pixel images with the CMYK pixel format."]
pub const TJCS_TJCS_YCCK: TJCS = 4;
#[doc = " JPEG colorspaces"]
pub type TJCS = libc::c_uint;
#[doc = " Error handling behavior"]
#[doc = ""]
#[doc = " **Value**"]
#[doc = " - `0` *[default]* Allow the current compression/decompression/transform"]
#[doc = " operation to complete unless a fatal error is encountered."]
#[doc = " - `1` Immediately discontinue the current"]
#[doc = " compression/decompression/transform operation if a warning (non-fatal"]
#[doc = " error) occurs."]
pub const TJPARAM_TJPARAM_STOPONWARNING: TJPARAM = 0;
#[doc = " Row order in packed-pixel source/destination images"]
#[doc = ""]
#[doc = " **Value**"]
#[doc = " - `0` *[default]* top-down (X11) order"]
#[doc = " - `1` bottom-up (Windows, OpenGL) order"]
pub const TJPARAM_TJPARAM_BOTTOMUP: TJPARAM = 1;
#[doc = " JPEG destination buffer (re)allocation [compression, lossless"]
#[doc = " transformation]"]
#[doc = ""]
#[doc = " **Value**"]
#[doc = " - `0` *[default]* Attempt to allocate or reallocate the JPEG destination"]
#[doc = " buffer as needed."]
#[doc = " - `1` Generate an error if the JPEG destination buffer is invalid or too"]
#[doc = " small."]
pub const TJPARAM_TJPARAM_NOREALLOC: TJPARAM = 2;
#[doc = " Perceptual quality of lossy JPEG images [compression only]"]
#[doc = ""]
#[doc = " **Value**"]
#[doc = " - `1`-`100` (`1` = worst quality but best compression, `100` = best"]
#[doc = " quality but worst compression) *[no default; must be explicitly"]
#[doc = " specified]*"]
pub const TJPARAM_TJPARAM_QUALITY: TJPARAM = 3;
#[doc = " Chrominance subsampling level"]
#[doc = ""]
#[doc = " The JPEG or YUV image uses (decompression, decoding) or will use (lossy"]
#[doc = " compression, encoding) the specified level of chrominance subsampling."]
#[doc = ""]
#[doc = " **Value**"]
#[doc = " - One of the @ref TJSAMP \"chrominance subsampling options\" *[no default;"]
#[doc = " must be explicitly specified for lossy compression, encoding, and"]
#[doc = " decoding]*"]
pub const TJPARAM_TJPARAM_SUBSAMP: TJPARAM = 4;
#[doc = " JPEG width (in pixels) [decompression only, read-only]"]
pub const TJPARAM_TJPARAM_JPEGWIDTH: TJPARAM = 5;
#[doc = " JPEG height (in pixels) [decompression only, read-only]"]
pub const TJPARAM_TJPARAM_JPEGHEIGHT: TJPARAM = 6;
#[doc = " Data precision (bits per sample)"]
#[doc = ""]
#[doc = " The JPEG image uses (decompression) or will use (lossless compression) the"]
#[doc = " specified number of bits per sample.  This parameter also specifies the"]
#[doc = " target data precision when loading a PBMPLUS file with #tj3LoadImage8(),"]
#[doc = " #tj3LoadImage12(), or #tj3LoadImage16() and the source data precision when"]
#[doc = " saving a PBMPLUS file with #tj3SaveImage8(), #tj3SaveImage12(), or"]
#[doc = " #tj3SaveImage16()."]
#[doc = ""]
#[doc = " The data precision is the number of bits in the maximum sample value,"]
#[doc = " which may not be the same as the width of the data type used to store the"]
#[doc = " sample."]
#[doc = ""]
#[doc = " **Value**"]
#[doc = " - `8` or `12` for lossy JPEG images; `2` to `16` for lossless JPEG and"]
#[doc = " PBMPLUS images"]
#[doc = ""]
#[doc = " 12-bit JPEG data precision implies #TJPARAM_OPTIMIZE unless"]
#[doc = " #TJPARAM_ARITHMETIC is set."]
pub const TJPARAM_TJPARAM_PRECISION: TJPARAM = 7;
#[doc = " JPEG colorspace"]
#[doc = ""]
#[doc = " The JPEG image uses (decompression) or will use (lossy compression) the"]
#[doc = " specified colorspace."]
#[doc = ""]
#[doc = " **Value**"]
#[doc = " - One of the @ref TJCS \"JPEG colorspaces\" *[default for lossy compression:"]
#[doc = " automatically selected based on the subsampling level and pixel format]*"]
pub const TJPARAM_TJPARAM_COLORSPACE: TJPARAM = 8;
#[doc = " Chrominance upsampling algorithm [lossy decompression only]"]
#[doc = ""]
#[doc = " **Value**"]
#[doc = " - `0` *[default]* Use smooth upsampling when decompressing a JPEG image"]
#[doc = " that was generated using chrominance subsampling.  This creates a smooth"]
#[doc = " transition between neighboring chrominance components in order to reduce"]
#[doc = " upsampling artifacts in the decompressed image."]
#[doc = " - `1` Use the fastest chrominance upsampling algorithm available, which"]
#[doc = " may combine upsampling with color conversion."]
pub const TJPARAM_TJPARAM_FASTUPSAMPLE: TJPARAM = 9;
#[doc = " DCT/IDCT algorithm [lossy compression and decompression]"]
#[doc = ""]
#[doc = " **Value**"]
#[doc = " - `0` *[default]* Use the most accurate DCT/IDCT algorithm available."]
#[doc = " - `1` Use the fastest DCT/IDCT algorithm available."]
#[doc = ""]
#[doc = " This parameter is provided mainly for backward compatibility with libjpeg,"]
#[doc = " which historically implemented several different DCT/IDCT algorithms"]
#[doc = " because of performance limitations with 1990s CPUs.  In the libjpeg-turbo"]
#[doc = " implementation of the TurboJPEG API:"]
#[doc = " - The \"fast\" and \"accurate\" DCT/IDCT algorithms perform similarly on"]
#[doc = " modern x86/x86-64 CPUs that support AVX2 instructions."]
#[doc = " - The \"fast\" algorithm is generally only about 5-15% faster than the"]
#[doc = " \"accurate\" algorithm on other types of CPUs."]
#[doc = " - The difference in accuracy between the \"fast\" and \"accurate\" algorithms"]
#[doc = " is the most pronounced at JPEG quality levels above 90 and tends to be"]
#[doc = " more pronounced with decompression than with compression."]
#[doc = " - For JPEG quality levels above 97, the \"fast\" algorithm degrades and is"]
#[doc = " not fully accelerated, so it is slower than the \"accurate\" algorithm."]
pub const TJPARAM_TJPARAM_FASTDCT: TJPARAM = 10;
#[doc = " Huffman table optimization [lossy compression, lossless transformation]"]
#[doc = ""]
#[doc = " **Value**"]
#[doc = " - `0` *[default]* The JPEG image will use the default Huffman tables."]
#[doc = " - `1` Optimal Huffman tables will be computed for the JPEG image.  For"]
#[doc = " lossless transformation, this can also be specified using"]
#[doc = " #TJXOPT_OPTIMIZE."]
#[doc = ""]
#[doc = " Huffman table optimization improves compression slightly (generally 5% or"]
#[doc = " less), but it reduces compression performance considerably."]
pub const TJPARAM_TJPARAM_OPTIMIZE: TJPARAM = 11;
#[doc = " Progressive JPEG"]
#[doc = ""]
#[doc = " In a progressive JPEG image, the DCT coefficients are split across"]
#[doc = " multiple \"scans\" of increasing quality.  Thus, a low-quality scan"]
#[doc = " containing the lowest-frequency DCT coefficients can be transmitted first"]
#[doc = " and refined with subsequent higher-quality scans containing"]
#[doc = " higher-frequency DCT coefficients.  When using Huffman entropy coding, the"]
#[doc = " progressive JPEG format also provides an \"end-of-bands (EOB) run\" feature"]
#[doc = " that allows large groups of zeroes, potentially spanning multiple MCUs,"]
#[doc = " to be represented using only a few bytes."]
#[doc = ""]
#[doc = " **Value**"]
#[doc = " - `0` *[default for compression, lossless transformation]* The lossy JPEG"]
#[doc = " image is (decompression) or will be (compression, lossless transformation)"]
#[doc = " single-scan."]
#[doc = " - `1` The lossy JPEG image is (decompression) or will be (compression,"]
#[doc = " lossless transformation) progressive.  For lossless transformation, this"]
#[doc = " can also be specified using #TJXOPT_PROGRESSIVE."]
#[doc = ""]
#[doc = " Progressive JPEG images generally have better compression ratios than"]
#[doc = " single-scan JPEG images (much better if the image has large areas of solid"]
#[doc = " color), but progressive JPEG compression and decompression is considerably"]
#[doc = " slower than single-scan JPEG compression and decompression.  Can be"]
#[doc = " combined with #TJPARAM_ARITHMETIC.  Implies #TJPARAM_OPTIMIZE unless"]
#[doc = " #TJPARAM_ARITHMETIC is also set."]
pub const TJPARAM_TJPARAM_PROGRESSIVE: TJPARAM = 12;
#[doc = " Progressive JPEG scan limit for lossy JPEG images [decompression, lossless"]
#[doc = " transformation]"]
#[doc = ""]
#[doc = " Setting this parameter causes the decompression and transform functions to"]
#[doc = " return an error if the number of scans in a progressive JPEG image exceeds"]
#[doc = " the specified limit.  The primary purpose of this is to allow"]
#[doc = " security-critical applications to guard against an exploit of the"]
#[doc = " progressive JPEG format described in"]
#[doc = " <a href=\"https://libjpeg-turbo.org/pmwiki/uploads/About/TwoIssueswiththeJPEGStandard.pdf\" target=\"_blank\">this report</a>."]
#[doc = ""]
#[doc = " **Value**"]
#[doc = " - maximum number of progressive JPEG scans that the decompression and"]
#[doc = " transform functions will process *[default: `0` (no limit)]*"]
#[doc = ""]
#[doc = " @see #TJPARAM_PROGRESSIVE"]
pub const TJPARAM_TJPARAM_SCANLIMIT: TJPARAM = 13;
#[doc = " Arithmetic entropy coding"]
#[doc = ""]
#[doc = " **Value**"]
#[doc = " - `0` *[default for compression, lossless transformation]* The lossy JPEG"]
#[doc = " image uses (decompression) or will use (compression, lossless"]
#[doc = " transformation) Huffman entropy coding."]
#[doc = " - `1` The lossy JPEG image uses (decompression) or will use (compression,"]
#[doc = " lossless transformation) arithmetic entropy coding.  For lossless"]
#[doc = " transformation, this can also be specified using #TJXOPT_ARITHMETIC."]
#[doc = ""]
#[doc = " Arithmetic entropy coding generally improves compression relative to"]
#[doc = " Huffman entropy coding, but it reduces compression and decompression"]
#[doc = " performance considerably.  Can be combined with #TJPARAM_PROGRESSIVE."]
pub const TJPARAM_TJPARAM_ARITHMETIC: TJPARAM = 14;
#[doc = " Lossless JPEG"]
#[doc = ""]
#[doc = " **Value**"]
#[doc = " - `0` *[default for compression]* The JPEG image is (decompression) or"]
#[doc = " will be (compression) lossy/DCT-based."]
#[doc = " - `1` The JPEG image is (decompression) or will be (compression)"]
#[doc = " lossless/predictive."]
#[doc = ""]
#[doc = " In most cases, lossless JPEG compression and decompression is considerably"]
#[doc = " slower than lossy JPEG compression and decompression, and lossless JPEG"]
#[doc = " images are much larger than lossy JPEG images.  Thus, lossless JPEG images"]
#[doc = " are typically used only for applications that require mathematically"]
#[doc = " lossless compression.  Also note that the following features are not"]
#[doc = " available with lossless JPEG images:"]
#[doc = " - Colorspace conversion (lossless JPEG images always use #TJCS_RGB,"]
#[doc = " #TJCS_GRAY, or #TJCS_CMYK, depending on the pixel format of the source"]
#[doc = " image)"]
#[doc = " - Chrominance subsampling (lossless JPEG images always use #TJSAMP_444)"]
#[doc = " - JPEG quality selection"]
#[doc = " - DCT/IDCT algorithm selection"]
#[doc = " - Progressive JPEG"]
#[doc = " - Arithmetic entropy coding"]
#[doc = " - Compression from/decompression to planar YUV images"]
#[doc = " - Decompression scaling"]
#[doc = " - Lossless transformation"]
#[doc = ""]
#[doc = " @see #TJPARAM_LOSSLESSPSV, #TJPARAM_LOSSLESSPT"]
pub const TJPARAM_TJPARAM_LOSSLESS: TJPARAM = 15;
#[doc = " Lossless JPEG predictor selection value (PSV)"]
#[doc = ""]
#[doc = " **Value**"]
#[doc = " - `1`-`7` *[default for compression: `1`]*"]
#[doc = ""]
#[doc = " Lossless JPEG compression shares no algorithms with lossy JPEG"]
#[doc = " compression.  Instead, it uses differential pulse-code modulation (DPCM),"]
#[doc = " an algorithm whereby each sample is encoded as the difference between the"]
#[doc = " sample's value and a \"predictor\", which is based on the values of"]
#[doc = " neighboring samples.  If Ra is the sample immediately to the left of the"]
#[doc = " current sample, Rb is the sample immediately above the current sample, and"]
#[doc = " Rc is the sample diagonally to the left and above the current sample, then"]
#[doc = " the relationship between the predictor selection value and the predictor"]
#[doc = " is as follows:"]
#[doc = ""]
#[doc = " PSV | Predictor"]
#[doc = " ----|----------"]
#[doc = " 1   | Ra"]
#[doc = " 2   | Rb"]
#[doc = " 3   | Rc"]
#[doc = " 4   | Ra + Rb – Rc"]
#[doc = " 5   | Ra + (Rb – Rc) / 2"]
#[doc = " 6   | Rb + (Ra – Rc) / 2"]
#[doc = " 7   | (Ra + Rb) / 2"]
#[doc = ""]
#[doc = " Predictors 1-3 are 1-dimensional predictors, whereas Predictors 4-7 are"]
#[doc = " 2-dimensional predictors.  The best predictor for a particular image"]
#[doc = " depends on the image."]
#[doc = ""]
#[doc = " @see #TJPARAM_LOSSLESS"]
pub const TJPARAM_TJPARAM_LOSSLESSPSV: TJPARAM = 16;
#[doc = " Lossless JPEG point transform (Pt)"]
#[doc = ""]
#[doc = " **Value**"]
#[doc = " - `0` through ***precision*** *- 1*, where ***precision*** is the JPEG"]
#[doc = " data precision in bits *[default for compression: `0`]*"]
#[doc = ""]
#[doc = " A point transform value of `0` is necessary in order to generate a fully"]
#[doc = " lossless JPEG image.  (A non-zero point transform value right-shifts the"]
#[doc = " input samples by the specified number of bits, which is effectively a form"]
#[doc = " of lossy color quantization.)"]
#[doc = ""]
#[doc = " @see #TJPARAM_LOSSLESS, #TJPARAM_PRECISION"]
pub const TJPARAM_TJPARAM_LOSSLESSPT: TJPARAM = 17;
#[doc = " JPEG restart marker interval in MCUs [lossy compression,"]
#[doc = " lossless transformation]"]
#[doc = ""]
#[doc = " The nature of entropy coding is such that a corrupt JPEG image cannot"]
#[doc = " be decompressed beyond the point of corruption unless it contains restart"]
#[doc = " markers.  A restart marker stops and restarts the entropy coding algorithm"]
#[doc = " so that, if a JPEG image is corrupted, decompression can resume at the"]
#[doc = " next marker.  Thus, adding more restart markers improves the fault"]
#[doc = " tolerance of the JPEG image, but adding too many restart markers can"]
#[doc = " adversely affect the compression ratio and performance."]
#[doc = ""]
#[doc = " In typical JPEG images, an MCU (Minimum Coded Unit) is the minimum set of"]
#[doc = " interleaved \"data units\" (8x8 DCT blocks if the image is lossy or samples"]
#[doc = " if the image is lossless) necessary to represent at least one data unit"]
#[doc = " per component.  (For example, an MCU in an interleaved lossy JPEG image"]
#[doc = " that uses 4:2:2 subsampling consists of two luminance blocks followed by"]
#[doc = " one block for each chrominance component.)  In single-component or"]
#[doc = " non-interleaved JPEG images, an MCU is the same as a data unit."]
#[doc = ""]
#[doc = " **Value**"]
#[doc = " - the number of MCUs between each restart marker *[default: `0` (no"]
#[doc = " restart markers)]*"]
#[doc = ""]
#[doc = " Setting this parameter to a non-zero value sets #TJPARAM_RESTARTROWS to 0."]
pub const TJPARAM_TJPARAM_RESTARTBLOCKS: TJPARAM = 18;
#[doc = " JPEG restart marker interval in MCU rows [compression,"]
#[doc = " lossless transformation]"]
#[doc = ""]
#[doc = " See #TJPARAM_RESTARTBLOCKS for a description of restart markers and MCUs."]
#[doc = " An MCU row is a row of MCUs spanning the entire width of the image."]
#[doc = ""]
#[doc = " **Value**"]
#[doc = " - the number of MCU rows between each restart marker *[default: `0` (no"]
#[doc = " restart markers)]*"]
#[doc = ""]
#[doc = " Setting this parameter to a non-zero value sets #TJPARAM_RESTARTBLOCKS to"]
#[doc = " 0."]
pub const TJPARAM_TJPARAM_RESTARTROWS: TJPARAM = 19;
#[doc = " JPEG horizontal pixel density"]
#[doc = ""]
#[doc = " **Value**"]
#[doc = " - The JPEG image has (decompression) or will have (compression) the"]
#[doc = " specified horizontal pixel density *[default for compression: `1`]*."]
#[doc = ""]
#[doc = " This value is stored in or read from the JPEG header.  It does not affect"]
#[doc = " the contents of the JPEG image.  Note that this parameter is set by"]
#[doc = " #tj3LoadImage8() when loading a Windows BMP file that contains pixel"]
#[doc = " density information, and the value of this parameter is stored to a"]
#[doc = " Windows BMP file by #tj3SaveImage8() if the value of #TJPARAM_DENSITYUNITS"]
#[doc = " is `2`."]
#[doc = ""]
#[doc = " This parameter has no effect unless the JPEG colorspace (see"]
#[doc = " #TJPARAM_COLORSPACE) is #TJCS_YCbCr or #TJCS_GRAY."]
#[doc = ""]
#[doc = " @see TJPARAM_DENSITYUNITS"]
pub const TJPARAM_TJPARAM_XDENSITY: TJPARAM = 20;
#[doc = " JPEG vertical pixel density"]
#[doc = ""]
#[doc = " **Value**"]
#[doc = " - The JPEG image has (decompression) or will have (compression) the"]
#[doc = " specified vertical pixel density *[default for compression: `1`]*."]
#[doc = ""]
#[doc = " This value is stored in or read from the JPEG header.  It does not affect"]
#[doc = " the contents of the JPEG image.  Note that this parameter is set by"]
#[doc = " #tj3LoadImage8() when loading a Windows BMP file that contains pixel"]
#[doc = " density information, and the value of this parameter is stored to a"]
#[doc = " Windows BMP file by #tj3SaveImage8() if the value of #TJPARAM_DENSITYUNITS"]
#[doc = " is `2`."]
#[doc = ""]
#[doc = " This parameter has no effect unless the JPEG colorspace (see"]
#[doc = " #TJPARAM_COLORSPACE) is #TJCS_YCbCr or #TJCS_GRAY."]
#[doc = ""]
#[doc = " @see TJPARAM_DENSITYUNITS"]
pub const TJPARAM_TJPARAM_YDENSITY: TJPARAM = 21;
#[doc = " JPEG pixel density units"]
#[doc = ""]
#[doc = " **Value**"]
#[doc = " - `0` *[default for compression]* The pixel density of the JPEG image is"]
#[doc = " expressed (decompression) or will be expressed (compression) in unknown"]
#[doc = " units."]
#[doc = " - `1` The pixel density of the JPEG image is expressed (decompression) or"]
#[doc = " will be expressed (compression) in units of pixels/inch."]
#[doc = " - `2` The pixel density of the JPEG image is expressed (decompression) or"]
#[doc = " will be expressed (compression) in units of pixels/cm."]
#[doc = ""]
#[doc = " This value is stored in or read from the JPEG header.  It does not affect"]
#[doc = " the contents of the JPEG image.  Note that this parameter is set by"]
#[doc = " #tj3LoadImage8() when loading a Windows BMP file that contains pixel"]
#[doc = " density information, and the value of this parameter is stored to a"]
#[doc = " Windows BMP file by #tj3SaveImage8() if the value is `2`."]
#[doc = ""]
#[doc = " This parameter has no effect unless the JPEG colorspace (see"]
#[doc = " #TJPARAM_COLORSPACE) is #TJCS_YCbCr or #TJCS_GRAY."]
#[doc = ""]
#[doc = " @see TJPARAM_XDENSITY, TJPARAM_YDENSITY"]
pub const TJPARAM_TJPARAM_DENSITYUNITS: TJPARAM = 22;
#[doc = " Memory limit for intermediate buffers"]
#[doc = ""]
#[doc = " **Value**"]
#[doc = " - the maximum amount of memory (in megabytes) that will be allocated for"]
#[doc = " intermediate buffers, which are used with progressive JPEG compression and"]
#[doc = " decompression, Huffman table optimization, lossless JPEG compression, and"]
#[doc = " lossless transformation *[default: `0` (no limit)]*"]
pub const TJPARAM_TJPARAM_MAXMEMORY: TJPARAM = 23;
#[doc = " Image size limit [decompression, lossless transformation, packed-pixel"]
#[doc = " image loading]"]
#[doc = ""]
#[doc = " Setting this parameter causes the decompression, transform, and image"]
#[doc = " loading functions to return an error if the number of pixels in the source"]
#[doc = " image exceeds the specified limit.  This allows security-critical"]
#[doc = " applications to guard against excessive memory consumption."]
#[doc = ""]
#[doc = " **Value**"]
#[doc = " - maximum number of pixels that the decompression, transform, and image"]
#[doc = " loading functions will process *[default: `0` (no limit)]*"]
pub const TJPARAM_TJPARAM_MAXPIXELS: TJPARAM = 24;
#[doc = " Marker copying behavior [decompression, lossless transformation]"]
#[doc = ""]
#[doc = " **Value [lossless transformation]**"]
#[doc = " - `0` Do not copy any extra markers (including comments, JFIF thumbnails,"]
#[doc = " Exif data, and ICC profile data) from the source image to the destination"]
#[doc = " image."]
#[doc = " - `1` Do not copy any extra markers, except comment (COM) markers, from"]
#[doc = " the source image to the destination image."]
#[doc = " - `2` *[default]* Copy all extra markers from the source image to the"]
#[doc = " destination image."]
#[doc = " - `3` Copy all extra markers, except ICC profile data (APP2 markers), from"]
#[doc = " the source image to the destination image."]
#[doc = " - `4` Do not copy any extra markers, except ICC profile data (APP2"]
#[doc = " markers), from the source image to the destination image."]
#[doc = ""]
#[doc = " #TJXOPT_COPYNONE overrides this parameter for a particular transform."]
#[doc = " This parameter overrides any ICC profile that was previously associated"]
#[doc = " with the TurboJPEG instance using #tj3SetICCProfile()."]
#[doc = ""]
#[doc = " When decompressing, #tj3DecompressHeader() extracts the ICC profile from a"]
#[doc = " JPEG image if this parameter is set to `2` or `4`.  #tj3GetICCProfile()"]
#[doc = " can then be used to retrieve the profile."]
pub const TJPARAM_TJPARAM_SAVEMARKERS: TJPARAM = 25;
#[doc = " Parameters"]
pub type TJPARAM = libc::c_uint;
#[doc = " The error was non-fatal and recoverable, but the destination image may"]
#[doc = " still be corrupt."]
pub const TJERR_TJERR_WARNING: TJERR = 0;
#[doc = " The error was fatal and non-recoverable."]
pub const TJERR_TJERR_FATAL: TJERR = 1;
#[doc = " Error codes"]
pub type TJERR = libc::c_uint;
#[doc = " Do not transform the position of the image pixels."]
pub const TJXOP_TJXOP_NONE: TJXOP = 0;
#[doc = " Flip (mirror) image horizontally.  This transform is imperfect if there"]
#[doc = " are any partial iMCUs on the right edge (see #TJXOPT_PERFECT.)"]
pub const TJXOP_TJXOP_HFLIP: TJXOP = 1;
#[doc = " Flip (mirror) image vertically.  This transform is imperfect if there are"]
#[doc = " any partial iMCUs on the bottom edge (see #TJXOPT_PERFECT.)"]
pub const TJXOP_TJXOP_VFLIP: TJXOP = 2;
#[doc = " Transpose image (flip/mirror along upper left to lower right axis.)  This"]
#[doc = " transform is always perfect."]
pub const TJXOP_TJXOP_TRANSPOSE: TJXOP = 3;
#[doc = " Transverse transpose image (flip/mirror along upper right to lower left"]
#[doc = " axis.)  This transform is imperfect if there are any partial iMCUs in the"]
#[doc = " image (see #TJXOPT_PERFECT.)"]
pub const TJXOP_TJXOP_TRANSVERSE: TJXOP = 4;
#[doc = " Rotate image clockwise by 90 degrees.  This transform is imperfect if"]
#[doc = " there are any partial iMCUs on the bottom edge (see #TJXOPT_PERFECT.)"]
pub const TJXOP_TJXOP_ROT90: TJXOP = 5;
#[doc = " Rotate image 180 degrees.  This transform is imperfect if there are any"]
#[doc = " partial iMCUs in the image (see #TJXOPT_PERFECT.)"]
pub const TJXOP_TJXOP_ROT180: TJXOP = 6;
#[doc = " Rotate image counter-clockwise by 90 degrees.  This transform is imperfect"]
#[doc = " if there are any partial iMCUs on the right edge (see #TJXOPT_PERFECT.)"]
pub const TJXOP_TJXOP_ROT270: TJXOP = 7;
#[doc = " Transform operations for #tj3Transform()"]
pub type TJXOP = libc::c_uint;
#[doc = " Scaling factor"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct tjscalingfactor {
    #[doc = " Numerator"]
    pub num: libc::c_int,
    #[doc = " Denominator"]
    pub denom: libc::c_int,
}
#[test]
fn bindgen_test_layout_tjscalingfactor() {
    assert_eq!(
        ::core::mem::size_of::<tjscalingfactor>(),
        8usize,
        concat!("Size of: ", stringify!(tjscalingfactor))
    );
    assert_eq!(
        ::core::mem::align_of::<tjscalingfactor>(),
        4usize,
        concat!("Alignment of ", stringify!(tjscalingfactor))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<tjscalingfactor>())).num as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(tjscalingfactor),
            "::",
            stringify!(num)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<tjscalingfactor>())).denom as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(tjscalingfactor),
            "::",
            stringify!(denom)
        )
    );
}
#[doc = " Cropping region"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct tjregion {
    #[doc = " The left boundary of the cropping region.  For lossless transformation,"]
    #[doc = " this must be evenly divisible by the iMCU width (see #tjMCUWidth) of the"]
    #[doc = " destination image.  For decompression, this must be evenly divisible by"]
    #[doc = " the scaled iMCU width of the source image."]
    pub x: libc::c_int,
    #[doc = " The upper boundary of the cropping region.  For lossless transformation,"]
    #[doc = " this must be evenly divisible by the iMCU height (see #tjMCUHeight) of the"]
    #[doc = " destination image."]
    pub y: libc::c_int,
    #[doc = " The width of the cropping region.  Setting this to 0 is the equivalent of"]
    #[doc = " setting it to the width of the source JPEG image - x."]
    pub w: libc::c_int,
    #[doc = " The height of the cropping region.  Setting this to 0 is the equivalent of"]
    #[doc = " setting it to the height of the source JPEG image - y."]
    pub h: libc::c_int,
}
#[test]
fn bindgen_test_layout_tjregion() {
    assert_eq!(
        ::core::mem::size_of::<tjregion>(),
        16usize,
        concat!("Size of: ", stringify!(tjregion))
    );
    assert_eq!(
        ::core::mem::align_of::<tjregion>(),
        4usize,
        concat!("Alignment of ", stringify!(tjregion))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<tjregion>())).x as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(tjregion),
            "::",
            stringify!(x)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<tjregion>())).y as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(tjregion),
            "::",
            stringify!(y)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<tjregion>())).w as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(tjregion),
            "::",
            stringify!(w)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<tjregion>())).h as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(tjregion),
            "::",
            stringify!(h)
        )
    );
}
extern "C" {
    pub static TJUNCROPPED: tjregion;
}
#[doc = " Lossless transform"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct tjtransform {
    #[doc = " Cropping region"]
    pub r: tjregion,
    #[doc = " One of the @ref TJXOP \"transform operations\""]
    pub op: libc::c_int,
    #[doc = " The bitwise OR of one of more of the @ref TJXOPT_ARITHMETIC"]
    #[doc = " \"transform options\""]
    pub options: libc::c_int,
    #[doc = " Arbitrary data that can be accessed within the body of the callback"]
    #[doc = " function"]
    pub data: *mut libc::c_void,
    #[doc = " A callback function that can be used to modify the DCT coefficients after"]
    #[doc = " they are losslessly transformed but before they are transcoded to a new"]
    #[doc = " JPEG image.  This allows for custom filters or other transformations to be"]
    #[doc = " applied in the frequency domain."]
    #[doc = ""]
    #[doc = " @param coeffs pointer to an array of transformed DCT coefficients.  (NOTE:"]
    #[doc = " This pointer is not guaranteed to be valid once the callback returns, so"]
    #[doc = " applications wishing to hand off the DCT coefficients to another function"]
    #[doc = " or library should make a copy of them within the body of the callback.)"]
    #[doc = ""]
    #[doc = " @param arrayRegion #tjregion structure containing the width and height of"]
    #[doc = " the array pointed to by `coeffs` as well as its offset relative to the"]
    #[doc = " component plane.  TurboJPEG implementations may choose to split each"]
    #[doc = " component plane into multiple DCT coefficient arrays and call the callback"]
    #[doc = " function once for each array."]
    #[doc = ""]
    #[doc = " @param planeRegion #tjregion structure containing the width and height of"]
    #[doc = " the component plane to which `coeffs` belongs"]
    #[doc = ""]
    #[doc = " @param componentID ID number of the component plane to which `coeffs`"]
    #[doc = " belongs.  (Y, Cb, and Cr have, respectively, ID's of 0, 1, and 2 in"]
    #[doc = " typical JPEG images.)"]
    #[doc = ""]
    #[doc = " @param transformID ID number of the transformed image to which `coeffs`"]
    #[doc = " belongs.  This is the same as the index of the transform in the"]
    #[doc = " `transforms` array that was passed to #tj3Transform()."]
    #[doc = ""]
    #[doc = " @param transform a pointer to a #tjtransform structure that specifies the"]
    #[doc = " parameters and/or cropping region for this transform"]
    #[doc = ""]
    #[doc = " @return 0 if the callback was successful, or -1 if an error occurred."]
    pub customFilter: ::core::option::Option<
        unsafe extern "C" fn(
            coeffs: *mut libc::c_short,
            arrayRegion: tjregion,
            planeRegion: tjregion,
            componentID: libc::c_int,
            transformID: libc::c_int,
            transform: *mut tjtransform,
        ) -> libc::c_int,
    >,
}
#[test]
fn bindgen_test_layout_tjtransform() {
    assert_eq!(
        ::core::mem::size_of::<tjtransform>(),
        40usize,
        concat!("Size of: ", stringify!(tjtransform))
    );
    assert_eq!(
        ::core::mem::align_of::<tjtransform>(),
        8usize,
        concat!("Alignment of ", stringify!(tjtransform))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<tjtransform>())).r as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(tjtransform),
            "::",
            stringify!(r)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<tjtransform>())).op as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(tjtransform),
            "::",
            stringify!(op)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<tjtransform>())).options as *const _ as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(tjtransform),
            "::",
            stringify!(options)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<tjtransform>())).data as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(tjtransform),
            "::",
            stringify!(data)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<tjtransform>())).customFilter as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(tjtransform),
            "::",
            stringify!(customFilter)
        )
    );
}
#[doc = " TurboJPEG instance handle"]
pub type tjhandle = *mut libc::c_void;
extern "C" {
    pub static TJUNSCALED: tjscalingfactor;
}
extern "C" {
    #[doc = " Create a new TurboJPEG instance."]
    #[doc = ""]
    #[doc = " @param initType one of the @ref TJINIT \"initialization options\""]
    #[doc = ""]
    #[doc = " @return a handle to the newly-created instance, or NULL if an error occurred"]
    #[doc = " (see #tj3GetErrorStr().)"]
    pub fn tj3Init(initType: libc::c_int) -> tjhandle;
}
extern "C" {
    #[doc = " Destroy a TurboJPEG instance."]
    #[doc = ""]
    #[doc = " @param handle handle to a TurboJPEG instance.  If the handle is NULL, then"]
    #[doc = " this function has no effect."]
    pub fn tj3Destroy(handle: tjhandle);
}
extern "C" {
    #[doc = " Returns a descriptive error message explaining why the last command failed."]
